# --- Taps ---
tap "homebrew/bundle"
tap "homebrew/services"
tap "hashicorp/tap"

# --- Terminal Tools ---
brew "yazi"
brew "ffmpeg"
brew "sevenzip"
brew "jq"
brew "yq"
brew "poppler"
brew "fd"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "resvg"
brew "imagemagick"
brew "eza"
brew "lazygit"
brew "lazydocker"
brew "neovim"
brew "bat"
brew "fastfetch"
brew "starship"
brew "mise"
brew "shellcheck"
brew "httpie"

brew "kubectl"
brew "kubectx"
brew "derailed/k9s/k9s"
brew "helm"

brew "television"

# --- GUI apps (casks) ---
cask "ghostty"
cask "zed"
cask "nikitabobko/tap/aerospace"
cask "raycast"
cask "appcleaner"

# --- Fonts ---
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"

# --- Mac App Store apps (optional) ---
brew "mas"

mas "Slack", id: 803453959
